In [1]:
# https://colab.research.google.com/github/OpenClassrooms-Student-Center/fr-4452741-decouvrez-les-librairies-python-pour-la-data-science/blob/main/notebooks/P2/P2C2%20-%20Manipulez%20un%20dataframe.ipynb#scrollTo=193e1033

import pandas as pd
import numpy as np

prets = pd.read_csv("data/prets.csv")
prets.head()

   identifiant      ville     CP  ...  duree        type   taux
0            0   TOULOUSE  31100  ...    240  immobilier  1.168
1            1      PARIS  75009  ...     64  automobile  3.701
2            1      PARIS  75009  ...    300  immobilier  1.173
3            2  MARSEILLE  13010  ...    240  immobilier  0.972
4            3  MARSEILLE  13010  ...    180  immobilier  1.014

[5 rows x 8 columns]

In [2]:
# cr√©ez une nouvelle variable calculant le taux d'endettement de chaque individu.
# Ce taux correspond au pourcentage du revenu rembours√© chaque mois par un individu.
# Vous arrondirez le r√©sultat √† 2 chiffres apr√®s la virgule.

taux_endettement = (prets["remboursement"] / prets["taux"]) * 100
prets["taux_endettement"] = round(taux_endettement, 2)
prets.head()

   identifiant      ville     CP  ...        type   taux  taux_endettement
0            0   TOULOUSE  31100  ...  immobilier  1.168          96750.86
1            1      PARIS  75009  ...  automobile  3.701           6484.73
2            1      PARIS  75009  ...  immobilier  1.173         106381.07
3            2  MARSEILLE  13010  ...  immobilier  0.972          56845.68
4            3  MARSEILLE  13010  ...  immobilier  1.014          57793.89

[5 rows x 9 columns]

In [5]:
# renommer la variable taux en taux_interet pour eviter toute confusion:
prets.rename(columns={"taux": "taux_interet"}, inplace=True)
prets.head()

   identifiant      ville     CP  ...        type  taux_interet  taux_endettement
0            0   TOULOUSE  31100  ...  immobilier         1.168          96750.86
1            1      PARIS  75009  ...  automobile         3.701           6484.73
2            1      PARIS  75009  ...  immobilier         1.173         106381.07
3            2  MARSEILLE  13010  ...  immobilier         0.972          56845.68
4            3  MARSEILLE  13010  ...  immobilier         1.014          57793.89

[5 rows x 9 columns]

In [6]:
"""
Nous allons √† pr√©sent cr√©er deux derni√®res variables :

- 'cout_total' correspondant au cout total du pret √† partir du remboursement et de la duree
- 'benefices' correspondant aux b√©n√©fices mensuels r√©alis√©s par la banque sur le pr√™t

Nous simplifierons ici le calcul des b√©n√©fices par :

b√©n√©fices =  (ùê∂xùëá) 24 

avec:

C = cout total du pr√™t
T = taux d'int√©r√™t
"""

prets["cout_total"] = prets["remboursement"] * prets["duree"]

benefice_mensuel_realise = ((prets['cout_total'] * prets['taux_interet']) / 100) / 24
prets["benefices"] = round(benefice_mensuel_realise, 2)

prets.head()

   identifiant      ville     CP  ...  taux_endettement  cout_total  benefices
0            0   TOULOUSE  31100  ...          96750.86    271212.0     131.99
1            1      PARIS  75009  ...           6484.73     15360.0      23.69
2            1      PARIS  75009  ...         106381.07    374355.0     182.97
3            2  MARSEILLE  13010  ...          56845.68    132609.6      53.71
4            3  MARSEILLE  13010  ...          57793.89    105485.4      44.57

[5 rows x 11 columns]

In [7]:
# connaitre les 5 pr√™ts sur lesquels nous produisons le plus de b√©n√©fices. Mettez en place une solution pour les afficher :
prets.sort_values(by="benefices", ascending=False)
prets.head()

   identifiant      ville     CP  ...  taux_endettement  cout_total  benefices
0            0   TOULOUSE  31100  ...          96750.86    271212.0     131.99
1            1      PARIS  75009  ...           6484.73     15360.0      23.69
2            1      PARIS  75009  ...         106381.07    374355.0     182.97
3            2  MARSEILLE  13010  ...          56845.68    132609.6      53.71
4            3  MARSEILLE  13010  ...          57793.89    105485.4      44.57

[5 rows x 11 columns]

In [15]:
# Le taux d‚Äôendettement autoris√© est de 35%. Pourriez vous me communiquer le nombre de personnes ayant d√©pass√© ce seuil ?

mask_endettement_autorise = prets['taux_endettement'] > 35
clients_risque = prets.loc[mask_endettement_autorise, :]
clients_risque.shape[0]

244

In [16]:
# M√™me question, mais cette fois ci uniquement sur l‚Äôagence Parisienne
client_risque_paris = prets.loc[(mask_endettement_autorise) & (prets["ville"] == "PARIS"), :]
client_risque_paris.shape[0]

77

In [72]:
"""
Pour faciliter le traitement d‚Äô√©ventuelles futures demandes de pr√™ts, pourriez vous ajouter une variable nomm√©e 
risque qui aurait pour valeur Oui si le client est risqu√© (taux d‚Äôendettement > 35%), Non sinon.
Pour se faire, je vous conseille de cr√©er la variable risque en l'initialisant √† Non (ou Oui, √† votre pr√©f√©rence) et de ne modifier
que les lignes concern√©es par la valeur inverse :
"""

prets['risque'] = 'Non'
prets.loc[mask_endettement_autorise, 'risque'] = 'Oui'
prets

     identifiant      ville     CP  ...  cout_total  benefices  risque
0              0   TOULOUSE  31100  ...    271212.0     131.99     Oui
1              1      PARIS  75009  ...     15360.0      23.69     Oui
2              1      PARIS  75009  ...    374355.0     182.97     Oui
3              2  MARSEILLE  13010  ...    132609.6      53.71     Oui
4              3  MARSEILLE  13010  ...    105485.4      44.57     Oui
..           ...        ...    ...  ...         ...        ...     ...
239          224      PARIS  75008  ...    374637.0     188.26     Oui
240          224      PARIS  75008  ...      5955.0       8.49     Oui
241          225   BORDEAUX  33100  ...    157757.4      77.04     Oui
242          226      PARIS  75002  ...    698630.4     331.85     Oui
243          227      PARIS  75015  ...    130314.0      62.82     Oui

[244 rows x 12 columns]

In [32]:
# Combien de pr√™ts automobiles ont √©t√© accord√©s ? Quel est le co√ªt total moyen de ces derniers ?
prets_auto = prets.loc[prets["type"] == "automobile", :]

nombre_prets_auto = prets_auto.shape[0]
cout_total_moyen = prets_auto["cout_total"].mean()

print('Nous avons accord√©', nombre_prets_auto, 'pr√™ts automobiles, dont le co√ªt total moyen est de', round(cout_total_moyen, 2), '‚Ç¨')

Nous avons accord√© 16 pr√™ts automobiles, dont le co√ªt total moyen est de 13665.0 ‚Ç¨

In [33]:
# Quel est le b√©n√©fice mensuel total r√©alis√© par l‚Äôagence Toulousaine ?
benefice_mensuel_agence_toulouse = prets.loc[prets["ville"] == "TOULOUSE", "benefices"].sum()
round(benefice_mensuel_agence_toulouse, 2)

2138.07

In [40]:
# calculer l‚Äôinformation recherch√©e initialement, soit le chiffre d'affaires total de chacune de nos agences ?

prets.groupby("ville").sum()

=>             identifiant  ...                                             risque
ville                   ...
BORDEAUX          1718  ...   OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOui
LYON              2833  ...  OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiO...
MARSEILLE         7946  ...  OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiO...
NICE              2375  ...  OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiO...
PARIS             9849  ...  OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiO...
TOULOUSE          3162  ...  OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiO...

[6 rows x 11 columns]
=>                        identifiant  ...                                             risque
ville     type                     ...
BORDEAUX  immobilier         1718  ...   OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOui
LYON      automobile          360  ...                                          OuiOuiOui
          immobilier         2473  ...  OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiO...
MARSEILLE automobile          404  ...                                          OuiOuiOui
          immobilier         7542  ...  OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiO...
NICE      automobile          187  ...                                             OuiOui
          immobilier         2188  ...  OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiO...
PARIS     automobile          612  ...                                    OuiOuiOuiOuiOui
          immobilier         9237  ...  OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiO...
TOULOUSE  automobile          442  ...                                          OuiOuiOui
          immobilier         2720  ...  OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiO...

[11 rows x 10 columns]
=>  ville      type
BORDEAUX   immobilier    15330.59
LYON       automobile      788.80
           immobilier    25275.87
MARSEILLE  automobile      839.60
           immobilier    40056.12
NICE       automobile      612.80
           immobilier    22931.44
PARIS      automobile     1426.60
           immobilier    92626.01
TOULOUSE   automobile      718.80
           immobilier    18567.38
Name: remboursement, dtype: float64
=>            remboursement               revenu
                    sum         mean     max
ville
BORDEAUX       15330.59   958.161875  3691.0
LYON           26064.67   930.881071  4771.0
MARSEILLE      40895.72   545.276267  2962.0
NICE           23544.24  1121.154286  5987.0
PARIS          94052.61  1221.462468  6807.0
TOULOUSE       19286.18   714.302963  3993.0

In [42]:
# par agence ET par type de pr√™t
prets.groupby(["ville", "type"]).sum()

                      identifiant  ...                                             risque
ville     type                     ...
BORDEAUX  immobilier         1718  ...   OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOui
LYON      automobile          360  ...                                          OuiOuiOui
          immobilier         2473  ...  OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiO...
MARSEILLE automobile          404  ...                                          OuiOuiOui
          immobilier         7542  ...  OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiO...
NICE      automobile          187  ...                                             OuiOui
          immobilier         2188  ...  OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiO...
PARIS     automobile          612  ...                                    OuiOuiOuiOuiOui
          immobilier         9237  ...  OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiO...
TOULOUSE  automobile          442  ...                                          OuiOuiOui
          immobilier         2720  ...  OuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiOuiO...

[11 rows x 10 columns]

In [43]:
# sur la variable remboursement
prets.groupby(["ville", "type"])["remboursement"].sum()

ville      type
BORDEAUX   immobilier    15330.59
LYON       automobile      788.80
           immobilier    25275.87
MARSEILLE  automobile      839.60
           immobilier    40056.12
NICE       automobile      612.80
           immobilier    22931.44
PARIS      automobile     1426.60
           immobilier    92626.01
TOULOUSE   automobile      718.80
           immobilier    18567.38
Name: remboursement, dtype: float64

In [58]:
# calcule la moyenne et la somme de remboursement par agence, ainsi que le maximum de revenu
remb_agence = prets.groupby("ville").agg({"remboursement": ["sum", "mean"], "revenu": "max"})
remb_agence

          remboursement               revenu
                    sum         mean     max
ville
BORDEAUX       15330.59   958.161875  3691.0
LYON           26064.67   930.881071  4771.0
MARSEILLE      40895.72   545.276267  2962.0
NICE           23544.24  1121.154286  5987.0
PARIS          94052.61  1221.462468  6807.0
TOULOUSE       19286.18   714.302963  3993.0

In [45]:
# Agr√©gez des lignes et des colonnes: Calcule du chiffre d'affaire d√©gag√© par chaque agence en fonction du type de pr√™t contracter
ca_agence = prets.pivot_table(index="ville", columns="type", values="remboursement", aggfunc="sum")
ca_agence

type       automobile  immobilier
ville
BORDEAUX          NaN    15330.59
LYON            788.8    25275.87
MARSEILLE       839.6    40056.12
NICE            612.8    22931.44
PARIS          1426.6    92626.01
TOULOUSE        718.8    18567.38

In [53]:
ca_agence.reset_index()

type      ville  automobile  immobilier
0      BORDEAUX         NaN    15330.59
1          LYON       788.8    25275.87
2     MARSEILLE       839.6    40056.12
3          NICE       612.8    22931.44
4         PARIS      1426.6    92626.01
5      TOULOUSE       718.8    18567.38

In [62]:
# transformation inverse avec melt
# ca_agence.melt(id_vars='ville', value_vars=['automobile', 'immobilier'])

In [75]:
# cr√©er un data frame de profil client pour avoir par client toutes les informations qui le concernent, r√©sum√©es en une ligne
profile_clients = prets.groupby("identifiant")[['revenu','remboursement','duree','taux_endettement','cout_total','benefices']].sum()
profile_clients.reset_index(inplace=True)
profile_clients.head()

   identifiant   revenu  remboursement  ...  taux_endettement  cout_total  benefices
0            0   3669.0        1130.05  ...          96750.86    271212.0     131.99
1            1  10620.0        1487.85  ...         112865.80    389715.0     206.66
2            2   1873.0         552.54  ...          56845.68    132609.6      53.71
3            3   1684.0         586.03  ...          57793.89    105485.4      44.57
4            4   1476.0         423.61  ...          35038.05    101666.4      51.21

[5 rows x 7 columns]

In [76]:
# calculer le nombre exact de personnes en √©tat de situation bancaire risqu√©e, √† partir du taux d‚Äôendettement et de ces profils clients
nombre_client_risque = profile_clients.loc[profile_clients["taux_endettement"] > 35, :].shape[0]
print('Il y a', nombre_client_risque, 'clients qui ont d√©pass√© le seuil autoris√©')

Il y a 228 clients qui ont d√©pass√© le seuil autoris√©

In [80]:
# calculer le b√©n√©fice total d√©gag√© par chacune de nos agences, par type de pr√™t
benefice_total_par_agence = prets.groupby(['ville', 'type'])["benefices"].sum()
benefice_total_par_agence.reset_index()

        ville        type  benefices
0    BORDEAUX  immobilier    1681.32
1        LYON  automobile      47.39
2        LYON  immobilier    2967.41
3   MARSEILLE  automobile      61.36
4   MARSEILLE  immobilier    4334.55
5        NICE  automobile      31.15
6        NICE  immobilier    2651.60
7       PARIS  automobile      99.50
8       PARIS  immobilier    9916.85
9    TOULOUSE  automobile      61.22
10   TOULOUSE  immobilier    2076.85

In [82]:
# calculer les b√©n√©fices moyens r√©alis√©s par chaque agence, pour chaque type de pr√™t, sous forme de tableau √† double entr√©e 
benefices_moyens = prets.pivot_table(index="ville", columns="type", values="benefices", aggfunc="mean")
benefices_moyens.reset_index()

type      ville  automobile  immobilier
0      BORDEAUX         NaN  105.082500
1          LYON   15.796667  118.696400
2     MARSEILLE   20.453333   60.202083
3          NICE   15.575000  139.557895
4         PARIS   19.900000  137.734028
5      TOULOUSE   20.406667   86.535417